tap "dagger/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "lesmiscore/my"
tap "yt-dlp/taps"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# OpenType text shaping engine
brew "harfbuzz"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Python bindings for the PDF toolkit and renderer MuPDF
brew "pymupdf"
# Import Evernote ENEX files to Notion
brew "enex2notion"
# Text to speech, software speech synthesizer
brew "espeak"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# General purpose TCP-IP emulator
brew "libslirp"
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool Command Language
brew "tcl-tk"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Tracks most-used directories to make cd smarter
brew "z"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Dagger is an integrated platform to orchestrate the delivery of applications
brew "dagger/tap/dagger"
# youtube-dl fork fork fork with some more features
brew "lesmiscore/my/ytdl-patched"
# Time tracker
cask "activitywatch"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# E-books management software
cask "calibre"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Clipboard extension app
cask "clipy"
# Voice and text chat software
cask "discord"
# Online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-hackgen"
cask "font-hackgen-nerd"
# Web browser
cask "google-chrome"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# Keyboard customiser
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Interface for reading and syncing eBooks
cask "kindle"
# Open-source, self-hosted Slack-alternative
cask "mattermost"
# Create digital art and comics
cask "medibangpaintpro"
# Multi-platform web browser
cask "microsoft-edge"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# MySQL/MariaDB database management
cask "sequel-ace"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Time tracker
cask "toggl-track"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdGuard for Safari", id: 1440147259
mas "Evernote", id: 406056744
mas "Focus To-Do", id: 1258530160
mas "GPTWebHelper", id: 6470203561
mas "Keepa - Price Tracker", id: 1533805339
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Kindle Classic", id: 405399194
mas "LINE", id: 539883307
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1542143627
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Toggl Track", id: 1291898086
mas "Twitter", id: 1482454543
vscode "bierner.markdown-mermaid"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "formulahendry.code-runner"
vscode "hediet.vscode-drawio"
vscode "johnpapa.vscode-peacock"
vscode "lfs.vscode-emacs-friendly"
vscode "lostintangent.wikilens"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "openai.openai-chatgpt-adhoc"
vscode "rooveterinaryinc.roo-cline"
vscode "shardulm94.trailing-spaces"
vscode "yzhang.markdown-all-in-one"
