tap "homebrew/bundle"
tap "lesmiscore/my"
tap "yt-dlp/taps"
brew "xz"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "bash"
brew "bat"
brew "glib"
brew "ruby"
brew "cocoapods"
brew "delta"
brew "harfbuzz"
brew "mupdf"
brew "python@3.11"
brew "pymupdf"
brew "enex2notion"
brew "espeak"
brew "fd"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "libass"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "gobject-introspection"
brew "guile"
brew "hugo"
brew "jq"
brew "openssl@1.1"
brew "python@3.9"
brew "libslirp"
brew "mas"
brew "md5sha1sum"
brew "neovim"
brew "nghttp2"
brew "node"
brew "pwgen"
brew "pyenv"
brew "python@3.10"
brew "ripgrep"
brew "terminal-notifier"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"
brew "youtube-dl"
brew "yt-dlp"
brew "z"
brew "zoxide"
brew "lesmiscore/my/ytdl-patched"
cask "activitywatch"
cask "alfred"
cask "appcleaner"
cask "cheatsheet"
cask "clipy"
cask "deepl"
cask "discord"
cask "drawio"
cask "dropbox"
cask "firefox"
cask "grammarly"
cask "iina"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keyboardcleantool"
cask "mattermost"
cask "medibangpaintpro"
cask "microsoft-edge"
cask "obsidian"
cask "remnote"
cask "shiftit"
cask "toggl-track"
cask "vivaldi"
cask "vlc"
cask "xquartz"
cask "zoom"
vscode "alefragnani.bookmarks"
vscode "astallinger.sourcetrail"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dunstontc.vscode-rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "felixangelov.bloc"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "hediet.vscode-drawio"
vscode "johnpapa.vscode-peacock"
vscode "lfs.vscode-emacs-friendly"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "nash.awesome-flutter-snippets"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "njpwerner.autodocstring"
vscode "shardulm94.trailing-spaces"
vscode "usernamehw.errorlens"
vscode "yzhang.markdown-all-in-one"
